Revit 2024 API
Wood.TextureAngle Property
 The property labeled "Angle" from the "Wood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string TextureAngle { get; }
Visual Basic
Public Shared ReadOnly Property TextureAngle As String
	Get
Visual C++
public:
static property String^ TextureAngle {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDoubleArray3d".
See Also
Wood Class
Autodesk.Revit.DB.Visual Namespace